app/Models/DomandaModel.php

INSERT INTO `domande` (`domanda`, `punti`) VALUES ('test', '5')
---
    function create(&$row){
        $db = db_connect();
        $db->table("domande")->insert($row);
        $id = $db->insertId();

UPDATE `domande` SET `id_domanda` = '15', `domanda` = '2+2', `punti` = '4'
WHERE `id_domanda` = '15'
SELECT *
FROM `domande`
WHERE `id_domanda` = '15'
---
    public function put($domanda){
        $db = db_connect();
        $db->table("domande")->where("id_domanda", $domanda["id_domanda"])->update($domanda);
        $data = $db->table("domande")->where("id_domanda", $domanda["id_domanda"])->get()->getResultArray();