app/Models/QuizModel.php

SELECT *
FROM `quiz`
WHERE `id_quiz` = '1'
SELECT *
FROM `quiz`
---
    function get($id = false){
        $db = db_connect();
        $builder = $db->table("quiz");

        if($id){
            $builder = $builder->where("id_quiz", $id);
        }
        $query = $builder->get();
        $result = array();
        foreach($query->getResultArray() as $row){

INSERT INTO `quiz` (`nome`, `descrizione`, `punteggio`) VALUES ('quiz', 'descrizione quiz', '100')
---
    public function create(&$row){
        $db = db_connect();
        $db->table("quiz")->insert($row);
        $id = $db->insertId();

UPDATE `quiz` SET `id_quiz` = '2', `descrizione` = 'ccc'
WHERE `id_quiz` = '2'
SELECT *
FROM `quiz`
WHERE `id_quiz` = '3'
---
    public function put($quiz){
        $db = db_connect();
        $db->table("quiz")->where("id_quiz", $quiz["id_quiz"])->update($quiz);
        $data = $db->table("quiz")->where("id_quiz", $quiz["id_quiz"])->get()->getResultArray();

DELETE FROM `quiz`
WHERE `id_quiz` = '7'
---
    public function delete($id = null, bool $purge = false){
        $db = db_connect();
        $db->table("quiz")->delete(["id_quiz" => $id]);