app/Models/RispostaModel.php

INSERT INTO `risposte` (`risposta`, `corretta`) VALUES ('test', '0')
---
    function create(& $row){
        $db = db_connect();
        $db->table("risposte")->insert($row);

UPDATE `risposte` SET `id_risposta` = '19', `risposta` = 'aaaa'
WHERE `id_risposta` = '19'
SELECT *
FROM `risposte`
WHERE `id_risposta` = '19'
---
    public function put($risposta){
        $db = db_connect();
        $db->table("risposte")->where("id_risposta", $risposta["id_risposta"])->update($risposta);
        $data = $db->table("risposte")->where("id_risposta", $risposta["id_risposta"])->get()->getResultArray();